import sqlite3

connection = sqlite3.connect('../db/vacancies-sqlite.db')

cursor = connection.cursor()

connection.execute("PRAGMA foreign_keys = ON;")

cursor.execute(''' CREATE TABLE IF NOT EXISTS Organization 
                    (OrganizationID INTEGER PRIMARY KEY AUTOINCREMENT, 
                    OrganizationName TEXT NOT NULL)
                ''')
cursor.execute(''' CREATE TABLE IF NOT EXISTS Cluster 
                    (ClusterID INTEGER PRIMARY KEY AUTOINCREMENT, 
                    ClusterProfession TEXT,
                    Association TEXT)
                ''')
cursor.execute(''' CREATE TABLE IF NOT EXISTS Vacancy 
                    (VacancyID INTEGER PRIMARY KEY AUTOINCREMENT, 
                    OrganizationName TEXT,
                    OrganizationID INT,
                    VacancyName TEXT,
                    VacancyDesc TEXT, 
                    URL TEXT, 
                    Salary TEXT,
                    ClusterID INT,
                    FOREIGN KEY (OrganizationID) REFERENCES Organization (OrganizationID) ON DELETE CASCADE ON UPDATE CASCADE,
                    FOREIGN KEY (ClusterID) REFERENCES Cluster (ClusterID) ON DELETE CASCADE ON UPDATE CASCADE)
                ''')

cursor.execute('''
CREATE TRIGGER IF NOT EXISTS UpdateOrganizationID 
AFTER DELETE ON Organization
FOR EACH ROW
BEGIN
    UPDATE Organization SET OrganizationID = OrganizationID - 1
    WHERE OrganizationID > OLD.OrganizationID;
END;
''')

cursor.execute('''
CREATE TRIGGER IF NOT EXISTS UpdateClusterID 
AFTER DELETE ON Cluster
FOR EACH ROW
BEGIN
    UPDATE Cluster SET ClusterID = ClusterID - 1
    WHERE ClusterID > OLD.ClusterID;
END;
''')

cursor.execute('''
CREATE TRIGGER IF NOT EXISTS UpdateVacancyID 
AFTER DELETE ON Vacancy
FOR EACH ROW
BEGIN
    UPDATE Vacancy SET VacancyID = VacancyID - 1
    WHERE VacancyID > OLD.VacancyID;
END;
''')

cursor.execute('''
    INSERT INTO Organization(OrganizationName)
VALUES 
('ТехноГрупп'),
('АвтоМир'),
('Розничная Сеть'),
('Зеленый Угол'),
('Управляющая Компания'),
('Креативное Агентство'),
('Финансовая Группа'),
('Строительная Компания'),
('Медицинский Центр'),
('Образовательный Портал'),
('Логистическая Компания'),
('Туристическое Агентство'),
('Энергетическая Компания'),
('Производственная Фирма'),
('Интернет-магазин'),
('Клининговая Компания'),
('Ресторанный Холдинг'),
('Стартап в IT'),
('Агентство Недвижимости'),
('Спортивный Клуб'),
('Косметическая Компания'),
('Модное Бюро'),
('Телекоммуникационная Компания'),
('Агентство Рекламы'),
('IT Консалтинг'),
('Проектная Компания'),
('Сельскохозяйственная Фирма'),
('Авиационная Компания'),
('Центр Образования'),
('Научно-Исследовательский Институт');
''')
cursor.execute('''
    INSERT INTO Cluster( ClusterProfession, Association)
VALUES 
('Программист', 'Разработчик ПО, Системный администратор, Тестировщик программного обеспечения, Аналитик данных, Инженер по машинному обучению'),
('Механик', 'Автомеханик, Инженер-электрик, Технический специалист, Ремонтник бытовой техники, Машинист'),
('Продавец', 'Консультант по продажам, Менеджер по работе с клиентами, Кассир, Специалист по торговле, Маркетолог'),
('Флорист', 'Декоратор, Ландшафтный дизайнер, Специалист по цветочным композициям, Садовод, Агроном, Флорист'),
('Менеджер', 'Проектный менеджер, Операционный менеджер, Маркетинговый менеджер, Менеджер по продажам, HR-менеджер'),
('Дизайнер', 'Графический дизайнер, Веб-дизайнер, Дизайнер интерьеров, Модельер, Иконограф'),
('Аналитик', 'Бизнес-аналитик, Аналитик данных, Финансовый аналитик, Маркетинговый аналитик, Специалист по исследованиям'),
('Инженер', 'Инженер-строитель, Инженер-электрик, Инженер-механик, Инженер по качеству, Инженер по безопасности'),
('Медицинский работник', 'Врач, Медсестра, Фармацевт, Лаборант, Специалист по реабилитации'),
('Учитель', 'Учитель начальных классов, Преподаватель вуза, Репетитор, Методист, Педагог-психолог'),
('Специалист по продажам', 'Менеджер по продажам, Торговый представитель, Специалист по работе с клиентами'),
('Секретарь', 'Офис-менеджер, Помощник руководителя, Администратор'),
('Специалист по маркетингу', 'Маркетолог, Специалист по цифровому маркетингу, Бренд-менеджер'),
('Курьер', 'Курьер, Специалист по доставке, Логист'),
('Системный администратор', 'Администратор сетей, Специалист по IT-инфраструктуре'),
('Специалист по PR', 'PR-менеджер, Специалист по связям с общественностью'),
('Финансовый консультант', 'Аналитик, Финансовый советник, Инвестиционный консультант'),
('Специалист по безопасности', 'Охранник, Специалист по физической безопасности'),
('Тренер', 'Фитнес-тренер, Персональный тренер, Инструктор по спорту'),
('Разработчик игр', 'Гейм-дизайнер, Программист игр, Художник по концепт-арту'),
('Специалист по недвижимости', 'Риэлтор, Оценщик, Консультант по недвижимости'),
('Специалист по обслуживанию', 'Техник, Специалист по ремонту, Оператор'),
('Специалист по управлению проектами', 'PM, Scrum-мастер, Координатор проектов'),
('Специалист по логистике', 'Логист, Специалист по транспортировке, Менеджер по логистике'),
('Технический писатель', 'Автор документации, Специалист по контенту'),
('Специалист по обучению', 'Тренер, Инструктор, Методист'),
('Специалист по исследованиям', 'Научный сотрудник, Исследователь, Аналитик'),
('Клинический психолог', 'Психолог, Психотерапевт, Консультант'),
('Специалист по охране труда', 'Инженер по охране труда, Специалист по безопасности'),
('Координатор мероприятий', 'Организатор мероприятий, Менеджер по событиям');
''')

for i in range(10):
    cursor.execute('''
    INSERT INTO Vacancy(OrganizationName, OrganizationID, VacancyName, VacancyDesc, URL, Salary, ClusterID)
    VALUES
    ('ТехноГрупп', 1, 'Программист', 'Разработка и поддержка программного обеспечения', 'https://hh.ru/vacancy/1', 80000, 1),
    ('АвтоМир', 2, 'Механик', 'Ремонт и обслуживание автомобилей', 'https://hh.ru/vacancy/2', 60000, 2),
    ('Розничная Сеть', 3, 'Продавец', 'Консультирование клиентов и продажа товаров', 'https://hh.ru/vacancy/3', 50000, 3),
    ('Зеленый Угол', 4, 'Флорист', 'Создание цветочных композиций и оформление мероприятий', 'https://hh.ru/vacancy/4', 45000, 4),
    ('Управляющая Компания', 5, 'Менеджер', 'Управление проектами и координация работы команды', 'https://hh.ru/vacancy/5', 70000, 5),
    ('Креативное Агентство', 6, 'Дизайнер', 'Создание визуальных концепций для рекламных кампаний', 'https://hh.ru/vacancy/6', 75000, 6),
    ('Финансовая Группа', 7, 'Аналитик', 'Анализ финансовых данных и подготовка отчетов', 'https://hh.ru/vacancy/7', 90000, 7),
    ('Строительная Компания', 8, 'Инженер', 'Проектирование и управление строительными процессами', 'https://hh.ru/vacancy/8', 85000, 8),
    ('Медицинский Центр', 9, 'Врач', 'Консультации и лечение пациентов', 'https://hh.ru/vacancy/9', 120000, 9),
    ('Образовательный Портал', 10, 'Учитель', 'Преподавание и разработка учебных материалов', 'https://hh.ru/vacancy/10', 60000, 10),
    ('Логистическая Компания', 11, 'Логист', 'Оптимизация процессов доставки и хранения', 'https://hh.ru/vacancy/11', 70000, 11),
    ('Туристическое Агентство', 12, 'Менеджер по туризму', 'Организация путешествий и консультации клиентов', 'https://hh.ru/vacancy/12', 55000, 5),
    ('Энергетическая Компания', 13, 'Инженер-энергетик', 'Проектирование энергетических систем', 'https://hh.ru/vacancy/13', 95000, 8),
    ('Производственная Фирма', 14, 'Оператор станков', 'Управление производственными процессами', 'https://hh.ru/vacancy/14', 60000, 11),
    ('Интернет-магазин', 15, 'Менеджер по продажам', 'Продажа товаров через интернет', 'https://hh.ru/vacancy/15', 50000, 3),
    ('Клининговая Компания', 16, 'Уборщик', 'Уборка помещений и поддержание чистоты', 'https://hh.ru/vacancy/16', 30000, 11),
    ('Ресторанный Холдинг', 17, 'Шеф-повар', 'Организация работы кухни и меню', 'https://hh.ru/vacancy/17', 80000, 9),
    ('Стартап в IT', 18, 'Разработчик', 'Создание новых IT-продуктов', 'https://hh.ru/vacancy/18', 90000, 1),
    ('Агентство Недвижимости', 19, 'Риэлтор', 'Помощь в покупке и продаже недвижимости', 'https://hh.ru/vacancy/19', 70000, 20),
    ('Спортивный Клуб', 20, 'Тренер', 'Проведение тренировок и консультации клиентов', 'https://hh.ru/vacancy/20', 50000, 21);
    ''')

cursor.execute("SELECT * FROM Vacancy")
items = cursor.fetchall()
for item in items:
    print(item)

cursor.execute("SELECT * FROM Organization")
items = cursor.fetchall()
for item in items:
    print(item)

cursor.execute("SELECT * FROM Cluster")
items = cursor.fetchall()
for item in items:
    print(item)

cursor.execute("PRAGMA foreign_keys;")
print(cursor.fetchone())
connection.commit()
connection.close()
